/////引脚定义p1.0-p1.3  sc2274-M4 的D0-D3
/////        p1.4-p1.7   驱动模块 IN1-IN4	  right=P3^0;为驱动A  lift=P3^1;为驱动B
///// p2_0;p2_1;p2_2;p2_3 控制数码管位  P0控制数码管各位数码管显示 
/////  sbit  RX  =P2^6;sbit  TX  =P2^7;  控制超声波

/////        
#include <reg52.h>
#include <intrins.h>
#include <stdlib.h>	//随机数头文件  srand  rand 
void zuo();
void you();
sbit p2_0 = P2^0;
sbit p2_1 = P2^1;
sbit p2_2 = P2^2;
sbit p2_3 = P2^3;
sbit p1_0 = P1^0;
sbit p1_1 = P1^1;
sbit p1_2 = P1^2;
sbit p1_3 = P1^3;
unsigned int  time=0;
unsigned int  timer=0;
unsigned char posit=0;
unsigned long S=40;                       //设定初值 任意常数尽量在20——50
bit      flag =0;                         
sbit  RX  =P2^6;                         // 超声波接收数据口
sbit  TX  =P2^7;                         //超声波发送数据口
//sbit  ena  =P3^0;
//sbit  enb  =P3^2;

//////////////////////////////////////////////////////////
sbit in1=P1^4;
sbit in2=P1^5;
sbit in3=P1^6;
sbit in4=P1^7;
sbit right=P3^0;
sbit lift=P3^1;
////////////////////////////////////////////////////////////
/*******************************共阳LED段码表*******************************/
unsigned char code table[]={0xc0,0xf9,0xa4,0xb0,0x99,0x92,0x82,0xf8,0x80,0x90};  ///code的作用是告诉单片机，
//我定义的数据要放在ROM（程序存储区）里面，其实是相当与汇编里面的寻址MOVX(好像是)，因为C语言中没办法详细描述
//存入的是ROM还是RAM（寄存器），所以在软件中添加了这一个语句起到代替汇编指令的作用，对应的还有data是存入RAM的意思
/*******************************定义全局变量********************************/
/*********************************端口定义**********************************/
/////////////////////////////////////////////////////////////////////////
void delay1(unsigned int a)
{ 

unsigned int i,j,k;
for(i=a;i>0;i--)
    for(j=100;j>0;j--)
	for(k=100;k>0;k--);
}
/////////////////////////////////////////////////////////////////
void delay2(unsigned int s)
{
	unsigned int i;
	for(i=0; i<s; i++);

}

/********************************************************/
void delay3(unsigned int n)
{
   unsigned int v,l=0;                                                                          //有问题回去改！！！！！
   for(l=n;n>0;n--)
   for(v=0;v<20;v++);
} 					
/****************************************************************************
函数功能:数码管扫描延时子程序
入口参数:
出口参数:
****************************************************************************/

/****************************************************************************
函数功能:LED数码管显示程序
入口参数:k
出口参数:
****************************************************************************/
void Display(unsigned long x)
{  


p2_0=0;p2_1=1;p2_2=1;p2_3=1;
P0 =table[x/100%10];
delay3(10);


p2_0=1;p2_1=0;p2_2=1;p2_3=1;
P0 =table[x/10%10];
delay3(10);

p2_0=1;p2_1=1;p2_2=0;p2_3=1;
P0 =table[x%10];
delay3(10);

p2_0=1;p2_1=1;p2_2=1;p2_3=0;
P0 =table[x/1000%10];
delay3(10);

p2_3=1;
delay3(6);

}
		//关闭个位数码管
/*void display(int a)
{
unsigned int k=200;

while  (k--)
{
p2_0=0;p2_1=1;p2_2=1;p2_3=1;
P0 =table[a/1000%10];
delay(2);


p2_0=1;p2_1=0;p2_2=1;p2_3=1;
P0 =table[a/100%10];
delay(2);

p2_0=1;p2_1=1;p2_2=0;p2_3=1;
P0 =table[a/10%10];
delay(2);

p2_0=1;p2_1=1;p2_2=1;p2_3=0;
P0 =table[a%10];
delay(2);
}							
} */
void Conut(void)
	{
	 time=TH0*256+TL0;
	 TH0=0;
	 TL0=0;
	
	 S=(time*1.7)/100;     //算出来是CM
	 if((S>=400)||flag==1) //超出测量范围显示“-”
	 {	 
	  flag=0;
	  S=500;
	 }
	 }

void juli(unsigned int x)	//x判定小车转弯距离  单位厘米
{
	unsigned int a;
	unsigned int b;
	unsigned int c;
	unsigned int t=0;
	unsigned int g=0;
	unsigned int h=0;                 //设定第一次进入拐弯时


	//////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 距离大于时
	
	
   while(S<x)
	
	
	{
		///////////////////////////////////////////////////////////////
		if (h==0)
		{
			h++;
			delay3(400)	;
			right=1;
			lift=1;
			in1=0;
			in2=1;
			in3=1;
			in4=0;
			delay3(300) ;
		}

		delay3(200)	;
		//         srand(t);
		//         a=((char)rand())%10;
		//         b=(a+1)%2; 
		//         c=a%2;  
		right=0;
		lift=0;
		delay1(5);
		right=1;
		lift=1;
		in1=b;
		in2=c;
		in3=b;
		in4=c;
		
		
		
		////////////////////////////////////////////////////////////////////
		
		while(!RX);		//当RX为零时等待
		TR0=1;			    //开启计数
		while(RX);			//当RX为1计数并等待
		TR0=0;				//关闭计数
		Conut();			//计算
		//     P1=0X00;
			

		delay2(5000);
		//     P1=0X09;
		if(p1_0==1||p1_1==1||p1_2==1||p1_3==1)return;
		if(S>=x) {right=0;lift=0;delay3(6000);	}
		

	}




	////////////////////////////////////////////////////////////////////////////////////////////////////////
   while(S>=x)
	{	 
		//产生随机数
		//////////////////////////////////////////////////////
		srand(t);
		
			
		a=((char)rand())%10;
		b=(a+1)%2; 
		c=a%2;
		t++;
		if(t==100){t=0;}
		///////////////////////////////////
	

		
		////////////////////////////////////////////////
		right=1;
		lift=1;
		in1=1;
		in2=0;
		in3=0;
		in4=1;
		  		

		
	
		//////////////////////////////////////////////////////
		while(!RX);	                                                  	//当RX为零时等待
		TR0=1;			                                                 //开启计数
		while(RX);			                                           //当RX为1计数并等待
		TR0=0;			                                            	//关闭计数
		Conut();
			

		delay2(10000);
				if(p1_0==1||p1_1==1||p1_2==1||p1_3==1)return;
	

	                                                         //     P1=0X00;

		
		                                                               //     P1=0X0B;
	
	}
	

}
//////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////
void you()
{
	right=0;
	lift=0;
	delay1(5);
	right=1;
	lift=1;
	in1=1;
	in2=0;
	in3=1;
	in4=0;


//	while(!RX);		    //当RX为零时等待
//	TR0=1;			    //开启计数
//	while(RX);			//当RX为1计数并等待
//	TR0=0;				//关闭计数
//	Conut();			//计算
//     P1=0X00;
    delay3(3500);


}
void zuo()
{
    int k=1;
	while(k--)


	{
	right=0;
	lift=0;
	delay1(5);
	right=1;
	lift=1;
	in1=0;
	in2=1;
	in3=0;
	in4=1;
	
	
//	while(!RX);		//当RX为零时等待
//	TR0=1;			    //开启计数
//	while(RX);			//当RX为1计数并等待
//	TR0=0;				//关闭计数
//	Conut();			//计算
//	//     P1=0X00;
	delay3(3500); 
	}
	
   
	

}
void zd0() interrupt 1 		          //T0中断用来计数器溢出,超过测距范围
{
  TH0=0;
  TL0=0;
  flag=1;

				 //中断溢出标志
}
/********************************************************/
void  zd3()  interrupt 3 		     //T1中断用来扫描数码管和计20MS启动模块
{
///////////////////////////////

TH1=0x75;
TL1=0x30;
Display(S);
timer++;
if(timer>=10)
{
	timer=0;
	TX=1;			                //20MS  启动一次模块
	
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_();
	_nop_(); 
	_nop_(); 
	_nop_(); 
	_nop_();
	
	TX=0;

} 
}
////////////////////////////
///外部中断
void T1_tijkhge() interrupt 2
{
zuo();


}
void T0_tijkhge() interrupt 0
{
you();


}



//*********
/****************************************************************************
函数功能:主程序
入口参数:
出口参数:
****************************************************************************/
void main(void)
{ 	
	TMOD=0x11;		   //设T0为方式1，GATE=1；
	TH0=0;
	TL0=0;          
	TH1=0x75;		   //2MS定时
	TL1=0x30;
	ET0=1;              //允许T0中断
	EX1=1;	            //外部中断1
	EX0=1;				//外部中断0
	ET1=1;			   //允许T1中断
	TR1=1; 
	            //开启定时器
	IT1=1;     //外部中断1触发方式
	IT0=1;	   //外部中断0的触发方式
	EA=1;
		   //开启总中断
	 
//	char datavalue;
//////////////////////////////////////////////////////////////////////////
        while(!RX);		//当RX为零时等待
		TR0=1;			    //开启计数
		while(RX);			//当RX为1计数并等待
		TR0=0;				//关闭计数
		Conut();			//计算
		//     P1=0X00;
			

		delay2(5000);
						
  							//置输入状态
 ///////////////////////////////////////////////////////////////////////////// 
	while(1)
	{
						//端口初始化
	if(p1_0==1||p1_1==1||p1_2==1||p1_3==1)
	{	
 
		 if(p1_0==1)
		 {
	 		in1=0;
			in2=0;
			in3=0;
			in4=0;
	    		 
		   
		 }
		 if(p1_3==1)
		 {
			right=1;
			lift=1;
			in1=1;
			in2=0;
			in3=1;
			in4=0;
			delay3(1000);
			right=1;
			lift=1;
			in1=1;
			in2=0;
			in3=0;
			in4=1;
			 
		 }
		  if(p1_2==1)
		 {
		   
			right=1;
			lift=1;
			in1=0;
			in2=1;
			in3=1;
			in4=0;
			 
		 }
		 if(p1_1==1)
		 {
	 		right=1;
			lift=1;
			in1=0;
			in2=1;
			in3=0;
			in4=1;
			delay3(1000);
			right=1;
			lift=1;
			in1=1;
			in2=0;
			in3=0;
			in4=1;

		 }
		
	}
		
 	else
		juli(24);		   
		
		 
	}
}
